# Reference 
https://github.com/minsuk-heo/pandas/blob/master/Pandas_Cheatsheet.ipynb
# <span style="color:blue"> pandas? </span>
python library for data manipulation and analysis

In [9]:
import pandas as pd
data_frame = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list.csv')

In [10]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# <span style="color:blue"> data_frame? </span> 
dataframe is a 2-dimensional labeled data structure with columns

In [11]:
data_frame.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# <span style="color:blue"> series = data_frame.colname  </span>
Every single column in dataframe is series

In [12]:
type(data_frame.job)

pandas.core.series.Series

# <span style="color:blue"> series의 내용을 대문자로 data_frame.col.str.upper()  </span>

In [13]:
data_frame.job = data_frame.job.str.upper()
data_frame.head()

    name  age        job
0   John   20    STUDENT
1  Jenny   30  DEVELOPER
2   Nate   30    TEACHER
3  Julia   40    DENTIST
4  Brian   45    MANAGER

# <span style="color:blue"> Series는 list </span> 
**Series** is just wrapper fo r python list

In [14]:
s1 = pd.core.series.Series(['one', 'two', 'three'])
s2 = pd.core.series.Series([1, 2, 3])
pd.DataFrame(data=dict(word=s1, num=s2))

   num   word
0    1    one
1    2    two
2    3  three

# <span style="color:blue"> 엑셀과 유사한 pandas </span> 

Very similar to Excel spreadsheet view,  
support various functions for data manipulation and analysis.  
Fast based on Numpy.  
Easy to manipulate data for your purpose

# <span style="color:blue"> data_frame은 2차원 구조(row, col)  </span> 
A **Data frame** is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.

# <span style="color:blue"> pd.read_csv : csv 포맷 읽기  </span> 
# <span style="color:blue"> 읽은 후 df로 치환해서 계속 활용  </span>
by default, pandas support csv format

In [15]:
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list.csv')

In [16]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

#  <span style="color:blue"> comma로 구분된 txt 파일 읽기 가능 </span>

In [18]:
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list.txt')

In [19]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# <span style="color:blue"> txt 파일의 delimiter가 comma가 아닌 경우 </span>

In [20]:
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list_tab.txt', delimiter = "\t")

In [21]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# <span style="color:blue"> 첫 라인이 헤더가 아닌 경우 </span>

In [22]:
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list_no_head.csv', header = None)

In [23]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager

# <span style="color:blue"> 컬럼이름인 헤더 생성 가능 : df.columns </span>

In [24]:
df.columns = ['name', 'age', 'job']

In [25]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# <span style="color:blue"> 한 번에 헤더와 컬럼이름 생성 header=None, names=[' ',' ',' ']</span>

In [27]:
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])

In [29]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

# <span style="color:blue">딕셔너리에서 DataFrame생성: pd.DataFrame()</span>

In [30]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [31]:
df.head()

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

# <span style="color:blue"> 컬럼순서 바꾸기 df[[ 'c', 'b', 'a']] </span>

In [32]:
df = df[['name', 'age', 'job']]

In [33]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## <span style="color:blue"> OrderdDict 사용하기 </span>
OrderedDict helps you to have fixed column order at once

In [34]:
from collections import OrderedDict

In [35]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
          ('age', [20, 30, 30]),
          ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [36]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# <span style="color:blue"> 리스트 df : pd.DataFrame.from_records() </span>

In [37]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
column_name = ['name', 'age', 'job']
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [38]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# <span style="color:blue"> pd.DataFrame.from_items() : [colname,[ item1, item2, item3] ]구조 </span>

In [39]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [40]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# df를 파일에 쓰기

here is one dataframe example with header

In [41]:
friend_list = [ 
                ['name',['John', 'Jenny', 'nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [42]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   nate   30    teacher

# DataFrame을 파일에 쓰기 : df.to_csv()

In [43]:
df.to_csv('friend_list_from_df.csv')

# 아래 헤더가 없는 DataFrame 에서

In [44]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)

In [45]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

# CSV파일로 생성 : df.to_csv()

In [46]:
df.to_csv('friend_list_from_df.csv')

# txt파일로 생성 : df.to_csv()

In [47]:
df.to_csv('friend_list_from_df.txt')

by default, header and index are True like below, even if you don't mention it in the command

In [214]:
df.to_csv('friend_list_from_df.csv', header = True, index = True)

**header = False** means you don't want to create column names. no 0,1,2 at column name   
**index = False** means you don't want to create row names.  no 0,1,2 at row name

In [215]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

# 헤더 리스트를 지정해서 파일에 쓰기

In [216]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

#  **None** value 가 있는 경우

In [64]:
friend_list = [ 
                ['name',['John', None, 'nate']],
                ['age',[20,None,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [65]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [66]:
df.to_csv('friend_list_from_df.csv')

# None 값을 다른 표현으로 치환 : na_rep

In [68]:
df.to_csv('friend_list_from_df.csv', na_rep = '-')

# 파일에서 확인해 보면 '- '으로 표시

# Select Row

## col이름이 있는 경우 항목 읽기 : pd.DataFrame.from_items()

In [69]:
friend_list = [ 
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']] 
              ]
df = pd.DataFrame.from_items(friend_list)

In [70]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# 1행부터 2행까지 select : df[1:3]

In [71]:
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

# 특정 row만 select : df.loc[ [  ] ]

In [72]:
df.loc[[0,2]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [73]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

## 컬럼 단위 select : df.colname
## 컬럼단위 특정 조건으로 추출 : df[df.col>25]

In [74]:
df_filtered = df[df.age > 25]

In [75]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

# 컬럼단위 조건 쿼리 : df.query('col>조건')

In [76]:
df_filtered = df.query('age>25')

In [77]:
df_filtered

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [78]:
df_filtered = df[(df.age >25) & (df.name == 'Nate')]

In [79]:
df_filtered

   name  age      job
2  Nate   30  teacher

In [80]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# Filter Column

## by index
## col이름 없는 경우 행단위 읽기 : pd.DataFrame.from_records()

In [81]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

# 행과 열단위 읽기 : df.iloc[ , ] , 모든 행은 ':'

In [84]:
df.iloc[:, 0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

# 행과 지정 컬럼 읽기 : df.iloc[ , [ ] ]

In [85]:
df.iloc[:,[0,2]]

       0          2
0   John    student
1  Jenny  developer
2   Nate    teacher

In [86]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

## 파일에 헤더 이름 없을 시, 컬럼이름 지정해서 파일 읽기

In [88]:
# you can create column header for no header data at once
df = pd.read_csv('C:/Users/jeonc/0.Python_Code/friend_list_no_head.csv', header = None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 특정 컬럼만 출력 : df[['col1', 'col2']]

In [89]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

## 특정 컬럼만 출력 : df.filter(items=['col1', 'col2'])

In [90]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [91]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## 특정 문자열을 포함하는 컬럼 데이터 추출 : df.filter(like='문자',axis=1)

In [92]:
# select columns containing 'a'
df.filter(like='a',axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

## 정규식을 만족하는 컬럼 데이터 추출 : df.filter(regex=' ', axis=1)

In [93]:
# select columns using regex
df.filter(regex='b$',axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

# Drop rows

## 컬럼이름이 있는 딕셔너리 읽기, 행이름 표현(index)
## df = pd.DataFrame(딕셔너리 리스트, index = [  ,  ,  ])

In [94]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [95]:
df.head()

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

## 행 drop : df.drop(['index1','index2'])
## drop된 행도 df에 유지되어 있음 
dropped result will be shown, but dataframe keeps the dropped row

In [98]:
df.drop(['John', 'Nate'])

       age        job
Jenny   30  developer

In [99]:
df

       age        job
John    20    student
Jenny   30  developer
Nate    30    teacher

## df로 치환해야 drop된 행이 반영됨 : df = df.drop([ ,])
you can assign the result to dataframe to keep the dropped result like below,

In [100]:
df = df.drop(['John', 'Nate'])

In [101]:
df

       age        job
Jenny   30  developer

### 행 drop 시 'in place' 사용 : df.drop(['row index1','row index2'], inplace=True)
The dropped row will be deleted from dataframe with inplace keyword parameter

In [102]:
friend_dict_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, index = ['John', 'Jenny', 'Nate'])

In [103]:
df.drop(['John', 'Nate'], inplace = True)

In [104]:
df

       age        job
Jenny   30  developer

## row id 즉 인덱스 번호로 drop하기 : df.drop(df.index[ [0,2]], 여기서는 0번째와 2번째 인덱스(row id)

In [110]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [111]:
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

### 행 삭제 시 index 사용 : df.index[[0,2]]
you can drop rows by its index

In [112]:
df = df.drop(df.index[[0,2]])

In [113]:
df

   age        job   name
1   30  developer  Jenny

## By Column value

In [114]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

### 컬럼값이 30이 아닌 경우 select

In [115]:
df = df[df.age != 30]

In [116]:
df

   age      job  name
0   20  student  Jone

# 컬럼 Drop

In [117]:
friend_dict_list = [{'name': 'Jone', 'age': 20, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list)
df

   age        job   name
0   20    student   Jone
1   30  developer  Jenny
2   30    teacher   Nate

### age컬럼 drop : df.drop('age', axis=1)

In [118]:
df = df.drop('age', axis=1)

In [119]:
df

         job   name
0    student   Jone
1  developer  Jenny
2    teacher   Nate

# 컬럼 추가와 업데이트

In [120]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

## 컬럼 추가 (추가시 default value 이용) : df['col']=default값

In [121]:
df['salary'] = 0

In [122]:
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

## 기존 컬럼값을 이용해서 신규 컬럼 추가하기

In [123]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'},
         {'name': 'Jenny', 'age': 30, 'job': 'developer'},
         {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

## 기존 컬럼값의 조건값에 따른 신규 컬럼 추가 : np.where()

In [124]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student' , 'yes', 'no')

In [125]:
df

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [126]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

## 2개 컬럼 더하기 후 컬럼 추가 : df['col1'] + df['col2']

In [127]:
df['total'] = df['midterm'] + df['final']

In [128]:
df

    name  midterm  final  total
0   John       95     85    180
1  Jenny       85     80    165
2   Nate       10     30     40

## columm from existing column

In [129]:
df['average'] = df['total'] / 2

In [130]:
df

    name  midterm  final  total  average
0   John       95     85    180     90.0
1  Jenny       85     80    165     82.5
2   Nate       10     30     40     20.0

## 조건식을 통한 컬럼값 추가 : for row in df['col'] : if, elif, else, append()

In [131]:
grades = []

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    elif row >= 70:
        grades.append('C')
    else:
        grades.append('F')
        
df['grade'] = grades

In [132]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0     A
1  Jenny       85     80    165     82.5     B
2   Nate       10     30     40     20.0     F

## 함수 사용하기 : def, df.grade.apply(함수명)
apply function helps you code concisely.
the function will be applied to selected column(s) on all rows

In [133]:
def pass_or_fail(row):
    print(row)
    if row != "F":
        return 'Pass'
    else:
        return 'Fail'

In [134]:
df.grade = df.grade.apply(pass_or_fail)

A
B
F

In [136]:
df

    name  midterm  final  total  average grade
0   John       95     85    180     90.0  Pass
1  Jenny       85     80    165     82.5  Pass
2   Nate       10     30     40     20.0  Fail

## 함수 적용해서 특정값 추출하기 : df.apply

In [137]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

### row값에서 분리해 내기 : row.split('-')

In [138]:
def extract_year(row):
    return row.split('-')[0]

In [139]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [140]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

## apply 함수 시, 키 파라미터 전달하기 : df.apply(함수, 파라미터=값)
you also can send parameter to apply function

In [141]:
def extract_year(year, current_year):
    return current_year - int(year)

In [142]:
df['age'] = df['year'].apply(extract_year, current_year=2018)

In [143]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

## apply 함수 시, 멀티 파라미터 전달하기 
you also can send multiple parameter to apply function

In [144]:
def get_introduce(age, prefix, suffix):
    return prefix + str(age) + suffix

In [145]:
df['introduce'] = df['age'].apply(get_introduce, prefix="I am ", suffix=" years old")

In [146]:
df

   yyyy-mm-dd  year  age          introduce
0  2000-06-27  2000   18  I am 18 years old
1  2002-09-24  2002   16  I am 16 years old
2  2005-12-20  2005   13  I am 13 years old

## passing multiple columns to apply function
you can provide axis=1 in the apply function, so you send all column values to apply function

In [288]:
def get_introduce2(row):
    return "I was born in "+str(row.year)+" my age is "+str(row.age)
df.introduce = df.apply(get_introduce2, axis=1)

df

   yyyy-mm-dd  year  age                        introduce
0  2000-06-27  2000   18  I was born in 2000 my age is 18
1  2002-09-24  2002   16  I was born in 2002 my age is 16
2  2005-12-20  2005   13  I was born in 2005 my age is 13

## map function 사용하기 
if you give function as parameter, it works same as apply function on the column

In [147]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [148]:
def extract_year(row):
    return row.split('-')[0]

In [149]:
df['year'] = df['yyyy-mm-dd'].map(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

## 파라미터로 딕셔너리 전달 
if you give dictionary as parameter,  
column will be updated with new value like  
new value = dict['old value']

In [151]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

### map함수 이용하여 컬럼값 업데이트( job컬럼값을 변경)

In [152]:
df.job = df.job.map({"student":1,"developer":2,"teacher":3})
df

   age  job
0   20    1
1   30    2
2   30    3

## 모든 엘리먼트 변경 시, applymap : df.applymap(np.around)
update all elements in the dataframe at once

In [153]:
x_y = [{'x': 5.5, 'y': -5.6},
         {'x': -5.2, 'y': 5.5},
         {'x': -1.6, 'y': -4.5}]
df = pd.DataFrame(x_y)
df

     x    y
0  5.5 -5.6
1 -5.2  5.5
2 -1.6 -4.5

In [154]:
df = df.applymap(np.around)
df

     x    y
0  6.0 -6.0
1 -5.0  6.0
2 -2.0 -4.0

# 행 추가하기 : df.append(df2, ignore_index=True)

In [155]:
friend_dict_list = [{'name': 'John', 'midterm': 95, 'final': 85},
         {'name': 'Jenny', 'midterm': 85, 'final': 80},
         {'name': 'Nate', 'midterm': 10, 'final': 30}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30

In [156]:
df2 = pd.DataFrame([['Ben', 50,50]], columns = ['name', 'midterm', 'final'])

In [157]:
df2.head()

  name  midterm  final
0  Ben       50     50

In [158]:
df.append(df2, ignore_index=True)

    name  midterm  final
0   John       95     85
1  Jenny       85     80
2   Nate       10     30
3    Ben       50     50

# Group by : df.groupby('col').groups
group by command helps to get more information from given data

In [159]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [164]:
groupby_major = df.groupby('major')
#df.groupby('major').groups

In [165]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

here we can see, computer science has mostly man, while economic has mostly woman students

In [166]:
for name, group in groupby_major:
    print(name + ": " + str(len(group)))
    print(group)
    print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

### group object to dataframe

In [304]:
df_major_cnt = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [305]:
groupby_sex = df.groupby('sex')

here we can see, this school has balanced woman and man ratio

In [306]:
for name, group in groupby_sex:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [307]:
df_sex_cnt = pd.DataFrame({'count' : groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      6
1    male      5

# 중복 데이터 삭제 : df.duplicated(), df.drop_duplicates()
sometimes you need to drop duplicate rows and here is elegant way to to it

In [167]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

## check if there is duplicated row

In [168]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [169]:
df = df.drop_duplicates()

In [170]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [172]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [173]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

## 중복데이터는 최종 자료로

In [174]:
df.drop_duplicates(['name'], keep='last')

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [175]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

# None value 처리하기

In [192]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

## Null or NaN 체크하기 : df.info()

In [193]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
name    8 non-null object
job     8 non-null object
age     6 non-null float64
dtypes: float64(1), object(2)
memory usage: 168.0+ bytes

In [195]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

## Null or NaN 을 채우기 : tmp["col"] = tmp["coll"].fillna(0)

In [196]:
tmp = df
tmp["age"] = tmp["age"].fillna(0)
tmp

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

### median값으로 치환 : df["col"].fillna(df.groupby("col")["col2"].transform("median"), inplace=True)

In [185]:
# fill missing age with median age for each group (teacher, student)
df["age"].fillna(df.groupby("job")["age"].transform("median"), inplace=True)

In [186]:
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

# Unique : df.col.unique()

In [198]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

unique() gives you unique values of the column in list format

In [199]:
print( df.job.unique() )

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

# col 카운트 : df.col.value_counts() 
value_counts() gives you the number of item for each unique columns

In [200]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
developer            1
dentist              1
basketball player    1
Name: job, dtype: int64

# 2개의 DataFrame 합치기 : pd.concat()

In [201]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

## pd.concat
below is to add second dataframe as new rows in first dataframe

In [202]:
frames = [df1, df2]
result = pd.concat(frames, ignore_index=True)

In [203]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

## df.append
below is to add second dataframe as new rows in first dataframe

In [204]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])
result = df1.append(df2, ignore_index=True)

In [205]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

## pd.concat
below is to add second dataframe as new columns in first dataframe

In [206]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [207]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

# Concatenate two list as a dataframe

In [208]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame(
    {'label': label,
     'prediction': prediction
    })

comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5